num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "TIDL_cast_in"
  layer_type: "TIDL_DataLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 0
    size: 1
    element_type: 0
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "TIDL_cast_in_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 253.000015
    size: 1
    element_type: 0
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "1033"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: -46.7496147
    max: 45.2904091
    size: 1
    element_type: 3
    scale: 566.68914794921875
    zero_point: 0
  }
  weights {
    min: -0.112936698
    max: 0.106673062
    size: 1
    element_type: 3
    scale: 290144.84375
    zero_point: 0
  }
  bias {
    min: -2.47109771
    max: 3.15107226
    size: 12
    element_type: 0
    scale: 10399
    zero_point: 0
    value: 0.23814190924167633
    value: 0.0635967031121254
    value: -0.71941769123077393
    value: 0.67781013250350952
    value: -2.4710977077484131
    value: 1.2756128311157227
    value: 0.57716304063797
    value: 2.1849853992462158
    value: 0.020258979871869087
    value: 3.1510722637176514
    value: -0.61163932085037231
    value: -0.44967210292816162
  }
}
layers {
  layer_name: "473"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 36.8538704
    size: 1
    element_type: 0
    scale: 5.0333929061889648
    zero_point: 0
  }
  weights {
    min: -0.879577458
    max: 0.61804086
    size: 1
    element_type: 3
    scale: 37254.25
    zero_point: 0
  }
  bias {
    min: -1.28261459
    max: 3.0306
    size: 32
    element_type: 0
    scale: 10812.3798828125
    zero_point: 0
    value: 0.95838230848312378
    value: -0.06728837639093399
    value: 0.37616598606109619
    value: 0.88764643669128418
    value: -0.070441722869873047
    value: 0.60188722610473633
    value: -0.16560851037502289
    value: -0.060291390866041183
    value: -0.071017004549503326
    value: 0.70995980501174927
    value: -0.097443930804729462
    value: -0.10177023708820343
    value: 0.53202098608016968
    value: 0.67686277627944946
    value: 0.45569795370101929
    value: -0.030738530680537224
    value: -0.05416584387421608
    value: -1.2826145887374878
    value: -0.059601746499538422
    value: 0.60635495185852051
    value: 3.0306000709533691
    value: 0.45499801635742188
    value: -0.096848636865615845
    value: 2.2479641437530518
    value: 1.6459909677505493
    value: 0.552290678024292
    value: -0.10234355181455612
    value: -0.12880440056324005
    value: -0.19764438271522522
    value: 1.141079306602478
    value: -0.019831076264381409
    value: -0.11423121392726898
  }
}
layers {
  layer_name: "476"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 20.2146397
    size: 1
    element_type: 1
    scale: 12.614620208740234
    zero_point: 4294967168
  }
  weights {
    min: -0.50284338
    max: 0.285739183
    size: 1
    element_type: 0
    scale: 254.55241394042969
    zero_point: 0
  }
  bias {
    min: -3.53900409
    max: 4.32717896
    size: 64
    element_type: 0
    scale: 29.580472946166992
    zero_point: 0
    value: -0.040539108216762543
    value: 1.0972776412963867
    value: 2.6728153228759766
    value: 1.2342932224273682
    value: 4.069361686706543
    value: 0.10350256413221359
    value: 1.5315868854522705
    value: 1.1417874097824097
    value: 0.98821526765823364
    value: 1.6124773025512695
    value: 1.4869129657745361
    value: 0.37209537625312805
    value: 0.83159345388412476
    value: 1.0962576866149902
    value: 0.10663076490163803
    value: -0.13322490453720093
    value: 1.1174002885818481
    value: 1.3595002889633179
    value: 0.3524564802646637
    value: 0.24932554364204407
    value: 1.0118143558502197
    value: 0.92133069038391113
    value: 0.37453311681747437
    value: -0.94589054584503174
    value: 0.14404486119747162
    value: 0.14436134696006775
    value: -0.91495716571807861
    value: -0.041506312787532806
    value: -3.53900408744812
    value: 0.48643597960472107
    value: -0.33119839429855347
    value: -0.23221944272518158
    value: 0.26091033220291138
    value: 0.33921957015991211
    value: 2.6505565643310547
    value: 0.20009535551071167
    value: 0.38415828347206116
    value: 1.1471068859100342
    value: -0.46267783641815186
    value: 0.4857405424118042
    value: 0.35782817006111145
    value: 4.327178955078125
    value: 0.71834766864776611
    value: 2.2870793342590332
    value: 0.434522807598114
    value: 0.75420480966567993
    value: 0.24565279483795166
    value: -0.86385864019393921
    value: 0.064908020198345184
    value: 0.021613344550132751
    value: 0.750322163105011
    value: 0.737052321434021
    value: 0.0929662212729454
    value: 0.58912521600723267
    value: 0.565680980682373
    value: 1.0337686538696289
    value: 0.24680572748184204
    value: -0.0013233001809567213
    value: 0.29389810562133789
    value: 0.19214887917041779
    value: 0.57494181394577026
    value: -0.092436492443084717
    value: 1.4301109313964844
    value: 0.57879972457885742
  }
}
layers {
  layer_name: "479"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.2653685
    size: 1
    element_type: 0
    scale: 22.635744094848633
    zero_point: 0
  }
  weights {
    min: -1.08254266
    max: 0.78503
    size: 1
    element_type: 0
    scale: 118.24014282226562
    zero_point: 0
  }
  bias {
    min: -0.610667527
    max: 2.60653496
    size: 32
    element_type: 0
    scale: 49.107341766357422
    zero_point: 0
    value: 1.1395113468170166
    value: 0.54622316360473633
    value: 1.2936252355575562
    value: -0.10739567875862122
    value: 1.2210813760757446
    value: -0.11129080504179001
    value: 0.10923305153846741
    value: 0.16819795966148376
    value: 1.3196614980697632
    value: 1.6574146747589111
    value: -0.47363880276679993
    value: 0.92071503400802612
    value: 1.6852446794509888
    value: -0.49123859405517578
    value: 2.6065349578857422
    value: -0.61066752672195435
    value: 1.30873441696167
    value: 1.5687181949615479
    value: -0.27719774842262268
    value: 1.7898690700531006
    value: 0.97281217575073242
    value: 1.2967908382415771
    value: 1.0463413000106812
    value: 1.893667459487915
    value: 0.748048722743988
    value: 1.7272816896438599
    value: 0.74810212850570679
    value: 2.4841082096099854
    value: 0.89802283048629761
    value: 2.1397945880889893
    value: 0.14705079793930054
    value: 0.4639124870300293
  }
}
layers {
  layer_name: "482"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.36032057
    size: 1
    element_type: 0
    scale: 34.645229339599609
    zero_point: 0
  }
  weights {
    min: -0.70985043
    max: 0.423243672
    size: 1
    element_type: 0
    scale: 180.31967163085938
    zero_point: 0
  }
  bias {
    min: -0.368112445
    max: 2.83376884
    size: 32
    element_type: 0
    scale: 45.169528961181641
    zero_point: 0
    value: 0.38604572415351868
    value: 1.0298749208450317
    value: 1.0501799583435059
    value: 0.98747062683105469
    value: 1.2196182012557983
    value: 0.21343645453453064
    value: 1.9962176084518433
    value: 1.7283163070678711
    value: 0.20136977732181549
    value: 2.4533345699310303
    value: 1.74509859085083
    value: 0.028628863394260406
    value: 0.45937365293502808
    value: 0.72113931179046631
    value: 0.10581572353839874
    value: 0.5552794337272644
    value: 0.8223954439163208
    value: 0.7941402792930603
    value: 0.71269732713699341
    value: 0.43597888946533203
    value: 0.91345721483230591
    value: 1.6012539863586426
    value: -0.36811244487762451
    value: 1.4824453592300415
    value: 1.0877877473831177
    value: 1.3204071521759033
    value: 0.47259628772735596
    value: 2.56032657623291
    value: 0.56969141960144043
    value: 0.58490556478500366
    value: 2.8337688446044922
    value: 1.1349095106124878
  }
}
layers {
  layer_name: "485"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.89712
    size: 1
    element_type: 1
    scale: 28.660959243774414
    zero_point: 4294967168
  }
  weights {
    min: -1.4758631
    max: 2.36028671
    size: 1
    element_type: 0
    scale: 54.2307014465332
    zero_point: 0
  }
  bias {
    min: -3.13182402
    max: 4.39341736
    size: 32
    element_type: 0
    scale: 29.134496688842773
    zero_point: 0
    value: 4.2789101600646973
    value: 3.4018137454986572
    value: 1.682892918586731
    value: -1.3190720081329346
    value: 1.4303091764450073
    value: 1.6240191459655762
    value: -0.20861653983592987
    value: 3.4229907989501953
    value: -3.1318240165710449
    value: 2.8776552677154541
    value: -1.8444432020187378
    value: 3.5150840282440186
    value: -1.935067892074585
    value: 1.6944493055343628
    value: 1.8686848878860474
    value: -2.1999611854553223
    value: 0.946650505065918
    value: -1.9308515787124634
    value: -0.25319302082061768
    value: 0.167717844247818
    value: 0.86201602220535278
    value: 2.296539306640625
    value: 4.3934173583984375
    value: 0.72581982612609863
    value: 2.5026283264160156
    value: 0.5867164134979248
    value: 1.3860840797424316
    value: 1.7075740098953247
    value: -1.232547402381897
    value: 3.3172426223754883
    value: -1.1686750650405884
    value: 1.0035394430160522
  }
}
layers {
  layer_name: "488"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 12.7600737
    size: 1
    element_type: 0
    scale: 19.984210968017578
    zero_point: 0
  }
  weights {
    min: -1.39820611
    max: 0.920841515
    size: 1
    element_type: 0
    scale: 91.5458755493164
    zero_point: 0
  }
  bias {
    min: -3.74257874
    max: 6.50489664
    size: 32
    element_type: 0
    scale: 19.6774845123291
    zero_point: 0
    value: 1.0542525053024292
    value: -1.6294150352478027
    value: 1.0362917184829712
    value: -0.16601009666919708
    value: -1.1776328086853027
    value: 2.3463997840881348
    value: 3.9913747310638428
    value: 3.6005978584289551
    value: 4.0789170265197754
    value: 0.92939966917037964
    value: -0.0083268741145730019
    value: 0.039322245866060257
    value: -2.2138314247131348
    value: 0.3434162437915802
    value: 1.4735318422317505
    value: 0.395936518907547
    value: 0.28920000791549683
    value: -0.97840052843093872
    value: 0.059051163494586945
    value: 2.18056058883667
    value: 0.9203721284866333
    value: 6.5048966407775879
    value: -0.13882696628570557
    value: 2.9975876808166504
    value: 0.46499383449554443
    value: 1.5207587480545044
    value: 3.5755302906036377
    value: -0.31449654698371887
    value: -3.7425787448883057
    value: 0.46448850631713867
    value: 2.8405687808990479
    value: -1.1125637292861938
  }
}
layers {
  layer_name: "489"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 14.1283245
    size: 1
    element_type: 0
    scale: 9.9921054840087891
    zero_point: 0
  }
}
layers {
  layer_name: "490"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 14.1283245
    size: 1
    element_type: 0
    scale: 9.9921054840087891
    zero_point: 0
  }
}
layers {
  layer_name: "493"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 13.2622595
    size: 1
    element_type: 1
    scale: 19.227493286132812
    zero_point: 4294967168
  }
  weights {
    min: -0.99401778
    max: 1.60177088
    size: 1
    element_type: 0
    scale: 79.911552429199219
    zero_point: 0
  }
  bias {
    min: -2.60256338
    max: 6.16849184
    size: 64
    element_type: 0
    scale: 20.750614166259766
    zero_point: 0
    value: 2.8404271602630615
    value: 2.8120529651641846
    value: -0.23019428551197052
    value: 0.97882378101348877
    value: 1.1486145257949829
    value: 3.4814839363098145
    value: 1.0439201593399048
    value: -0.21547776460647583
    value: 0.29518479108810425
    value: -0.50276309251785278
    value: 0.4139941930770874
    value: -0.57974493503570557
    value: -0.85441452264785767
    value: -2.0257930755615234
    value: 0.86045390367507935
    value: 2.2709412574768066
    value: -1.2399386167526245
    value: 0.996475338935852
    value: -0.54670500755310059
    value: 1.3530443906784058
    value: 0.17649765312671661
    value: -0.89987665414810181
    value: -0.41389721632003784
    value: 0.707003653049469
    value: 0.38347092270851135
    value: 4.1353230476379395
    value: 2.9406664371490479
    value: 0.7045024037361145
    value: 0.96880441904067993
    value: 0.74920988082885742
    value: 1.219982385635376
    value: 2.3756163120269775
    value: 2.0182864665985107
    value: -1.1092468500137329
    value: -2.6025633811950684
    value: 0.48543274402618408
    value: -0.10570155829191208
    value: 2.0735037326812744
    value: 2.0972838401794434
    value: 1.6582001447677612
    value: 1.6993688344955444
    value: 1.1574150323867798
    value: 4.9593305587768555
    value: 1.5858783721923828
    value: 1.0143665075302124
    value: -0.47783204913139343
    value: 2.3336741924285889
    value: 6.1684918403625488
    value: -0.82677632570266724
    value: 2.6739749908447266
    value: 0.40357205271720886
    value: 3.1749296188354492
    value: 2.3400778770446777
    value: -0.0011277827434241772
    value: 2.2045295238494873
    value: 0.80621051788330078
    value: 1.9095317125320435
    value: 0.33902686834335327
    value: 0.33200553059577942
    value: 0.5787193775177002
    value: -2.2271323204040527
    value: 0.0763937309384346
    value: 0.50646263360977173
    value: 2.3349554538726807
  }
}
layers {
  layer_name: "496"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.4288321
    size: 1
    element_type: 1
    scale: 24.451444625854492
    zero_point: 4294967168
  }
  weights {
    min: -0.519884706
    max: 0.650459409
    size: 1
    element_type: 0
    scale: 196.78399658203125
    zero_point: 0
  }
  bias {
    min: -1.84046268
    max: 1.85354316
    size: 128
    element_type: 0
    scale: 69.056930541992188
    zero_point: 0
    value: 0.86207908391952515
    value: 0.831155002117157
    value: 0.42521467804908752
    value: 0.79054415225982666
    value: 0.16161823272705078
    value: 0.34854191541671753
    value: 1.6210328340530396
    value: 1.5986664295196533
    value: 0.008504912257194519
    value: 0.66880005598068237
    value: 0.41229885816574097
    value: 0.84893566370010376
    value: 1.1479636430740356
    value: -1.8404626846313477
    value: 0.41143155097961426
    value: -0.23475617170333862
    value: 0.15965470671653748
    value: 0.76558965444564819
    value: 1.3289855718612671
    value: 0.15493443608283997
    value: 0.65230172872543335
    value: 0.7948683500289917
    value: 0.14885185658931732
    value: 1.0773487091064453
    value: 0.86175757646560669
    value: 1.0589437484741211
    value: 0.56470060348510742
    value: 0.89779454469680786
    value: 0.83352231979370117
    value: 0.770248532295227
    value: 0.45008453726768494
    value: -0.80743759870529175
    value: -0.37773320078849792
    value: 1.1058945655822754
    value: 1.1355994939804077
    value: 0.74419736862182617
    value: 0.76814037561416626
    value: 0.86267352104187012
    value: -0.6142004132270813
    value: -0.26923346519470215
    value: 0.37522023916244507
    value: 0.687720000743866
    value: 1.3364542722702026
    value: 0.93123847246170044
    value: 0.13571326434612274
    value: 0.52451395988464355
    value: -0.18614254891872406
    value: 0.74487227201461792
    value: -0.40733957290649414
    value: 0.17047305405139923
    value: -1.7343381643295288
    value: 1.8394420146942139
    value: 0.65140706300735474
    value: 1.0421504974365234
    value: 0.71671366691589355
    value: 1.7746716737747192
    value: 0.52066177129745483
    value: -0.36602360010147095
    value: 0.62224674224853516
    value: 0.26715359091758728
    value: 1.0716251134872437
    value: 1.7603758573532104
    value: -0.20798410475254059
    value: 1.6885354518890381
    value: 0.93693041801452637
    value: 0.45947784185409546
    value: 0.69199162721633911
    value: 0.23758307099342346
    value: 0.73194700479507446
    value: 0.08675866574048996
    value: -0.85112106800079346
    value: 0.044330742210149765
    value: -0.59998703002929688
    value: 1.4140050411224365
    value: 0.047240272164344788
    value: 0.2085261195898056
    value: -0.2399059385061264
    value: 1.49493408203125
    value: 0.89833813905715942
    value: -0.13091419637203217
    value: -0.052429363131523132
    value: 0.63471168279647827
    value: 0.28475785255432129
    value: 0.29756057262420654
    value: 1.3646447658538818
    value: 1.1412928104400635
    value: -0.23649941384792328
    value: 0.024549564346671104
    value: 1.8535431623458862
    value: -0.43436425924301147
    value: -1.3500972986221313
    value: 0.86870735883712769
    value: -1.1210565567016602
    value: 0.757631778717041
    value: 0.7427557110786438
    value: 0.57063573598861694
    value: -0.14245891571044922
    value: -0.16820086538791656
    value: 0.78110313415527344
    value: 0.78363078832626343
    value: -0.17301905155181885
    value: 1.6221479177474976
    value: 0.70652484893798828
    value: 0.19692327082157135
    value: 0.19515925645828247
    value: 0.40936622023582458
    value: 0.69986206293106079
    value: 0.39216861128807068
    value: 0.10792473703622818
    value: 1.0847715139389038
    value: -0.4144151508808136
    value: 0.8995017409324646
    value: 0.948156476020813
    value: 1.0132067203521729
    value: 0.9934270977973938
    value: 1.1697465181350708
    value: 1.1970009803771973
    value: 1.0607250928878784
    value: 0.76358306407928467
    value: 1.132304310798645
    value: 0.049399774521589279
    value: 0.7699512243270874
    value: -0.37864741683006287
    value: -1.6808691024780273
    value: -1.0150537490844727
    value: 0.063182584941387177
    value: 0.844909131526947
    value: 0.94679993391036987
  }
}
layers {
  layer_name: "499"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.5795908
    size: 1
    element_type: 0
    scale: 22.021503448486328
    zero_point: 0
  }
  weights {
    min: -1.37953
    max: 1.50301361
    size: 1
    element_type: 0
    scale: 85.162239074707031
    zero_point: 0
  }
  bias {
    min: -4.71508408
    max: 3.53331089
    size: 64
    element_type: 0
    scale: 27.146917343139648
    zero_point: 0
    value: -3.2404303550720215
    value: -0.56165087223052979
    value: 1.5649477243423462
    value: 0.77262204885482788
    value: -1.0309847593307495
    value: 2.0739362239837646
    value: 2.7144386768341064
    value: -2.2498745918273926
    value: 0.21532414853572845
    value: 0.70943564176559448
    value: 2.1742467880249023
    value: 1.2451345920562744
    value: -0.2474222332239151
    value: -1.0348464250564575
    value: 1.6984406709671021
    value: -1.3794616460800171
    value: 3.5333108901977539
    value: 0.53090143203735352
    value: -0.25934195518493652
    value: 2.0946707725524902
    value: -2.1342945098876953
    value: -0.47046822309494019
    value: -0.63764339685440063
    value: 0.46042397618293762
    value: -0.14585672318935394
    value: 1.3703204393386841
    value: -1.5325621366500854
    value: 0.060989834368228912
    value: 1.4376429319381714
    value: 1.0567378997802734
    value: -2.6323232650756836
    value: 1.1628299951553345
    value: -0.0016089160926640034
    value: 1.330656886100769
    value: 1.016049861907959
    value: 1.8546112775802612
    value: 1.4072989225387573
    value: 0.29941403865814209
    value: 0.617762565612793
    value: -1.1856244802474976
    value: -1.3133900165557861
    value: 0.7360222339630127
    value: 1.0255082845687866
    value: 1.3084112405776978
    value: 3.0428054332733154
    value: 0.12703807651996613
    value: 0.850143551826477
    value: 1.5301806926727295
    value: -0.15156500041484833
    value: 1.2511318922042847
    value: 0.364298939704895
    value: -4.7150840759277344
    value: -0.16534566879272461
    value: -0.91518992185592651
    value: 0.025605298578739166
    value: -0.52371948957443237
    value: 1.1781980991363525
    value: 1.2585127353668213
    value: 1.815193772315979
    value: 0.074952811002731323
    value: -0.16001880168914795
    value: -0.66094297170639038
    value: 0.4489995539188385
    value: -0.43536946177482605
  }
}
layers {
  layer_name: "502"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 4.71847153
    size: 1
    element_type: 0
    scale: 54.042922973632812
    zero_point: 0
  }
  weights {
    min: -0.307909042
    max: 0.538169742
    size: 1
    element_type: 0
    scale: 237.84317016601562
    zero_point: 0
  }
  bias {
    min: -0.590554297
    max: 2.3241086
    size: 64
    element_type: 0
    scale: 55.074878692626953
    zero_point: 0
    value: 0.56933552026748657
    value: 0.62464076280593872
    value: 0.34492787718772888
    value: -0.59055429697036743
    value: 0.280229389667511
    value: 0.29701957106590271
    value: 1.1998865604400635
    value: 2.3241086006164551
    value: 1.3030774593353271
    value: 1.6991814374923706
    value: 0.7169378399848938
    value: 1.2834087610244751
    value: 0.435508131980896
    value: 1.1589821577072144
    value: -0.059026353061199188
    value: 0.0817405954003334
    value: 0.91737824678421021
    value: 0.21236060559749603
    value: 0.25286799669265747
    value: 0.82686769962310791
    value: 0.61573708057403564
    value: 0.024572081863880157
    value: 0.36590847373008728
    value: 0.038294792175292969
    value: 0.29971194267272949
    value: 0.94890648126602173
    value: 0.70663654804229736
    value: 0.70958989858627319
    value: 0.14438933134078979
    value: 0.199942946434021
    value: 1.5790207386016846
    value: 1.0786505937576294
    value: 0.089225985109806061
    value: 0.71753519773483276
    value: 1.2985707521438599
    value: 0.35694897174835205
    value: 1.3026211261749268
    value: 0.50211364030838013
    value: 0.5786750316619873
    value: 1.9208567142486572
    value: -0.030334992334246635
    value: 0.55165928602218628
    value: 0.95754170417785645
    value: 0.18026454746723175
    value: 1.5782756805419922
    value: 1.9465223550796509
    value: -0.44270980358123779
    value: 1.1547541618347168
    value: 1.0391695499420166
    value: 0.16928006708621979
    value: 0.72343212366104126
    value: 0.78932428359985352
    value: -0.019395191222429276
    value: 0.64670544862747192
    value: 0.0438954122364521
    value: -0.098517477512359619
    value: 1.0447282791137695
    value: 0.70083385705947876
    value: 0.94764167070388794
    value: 1.5981073379516602
    value: 0.679762601852417
    value: 0.25801214575767517
    value: 2.1864533424377441
    value: 0.30889353156089783
  }
}
layers {
  layer_name: "505"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.66010761
    size: 1
    element_type: 1
    scale: 29.445362091064453
    zero_point: 4294967168
  }
  weights {
    min: -1.35165536
    max: 1.42853189
    size: 1
    element_type: 0
    scale: 89.60247802734375
    zero_point: 0
  }
  bias {
    min: -5.03452158
    max: 3.85324168
    size: 64
    element_type: 0
    scale: 25.424461364746094
    zero_point: 0
    value: 2.2467894554138184
    value: -1.0483903884887695
    value: 1.0484123229980469
    value: -1.1039997339248657
    value: -1.8309264183044434
    value: -1.1275097131729126
    value: -1.95989990234375
    value: -0.63832306861877441
    value: -1.179452657699585
    value: -1.5034983158111572
    value: 2.0397675037384033
    value: 0.78451812267303467
    value: 1.2700297832489014
    value: 0.0098034683614969254
    value: -0.90487521886825562
    value: -3.391226053237915
    value: 1.3666701316833496
    value: -0.16385684907436371
    value: 3.3678247928619385
    value: -4.2091870307922363
    value: -3.262643575668335
    value: 1.7266803979873657
    value: 1.9891260862350464
    value: 0.85048443078994751
    value: 0.63656711578369141
    value: 1.0501892566680908
    value: 1.1408727169036865
    value: -1.79403555393219
    value: -0.40296110510826111
    value: -5.0345215797424316
    value: 2.0604288578033447
    value: -3.0072708129882812
    value: 1.1823583841323853
    value: 1.3125671148300171
    value: 0.38652849197387695
    value: 0.367098331451416
    value: -1.6056410074234009
    value: 1.0846583843231201
    value: -2.1087191104888916
    value: 3.5306937694549561
    value: 0.22232867777347565
    value: 2.0945847034454346
    value: 1.5805387496948242
    value: 0.48855212330818176
    value: 1.1386175155639648
    value: -3.291398286819458
    value: 1.838405966758728
    value: -1.1048133373260498
    value: 3.8532416820526123
    value: 0.31820446252822876
    value: 1.2284255027770996
    value: 0.60914647579193115
    value: 1.3838461637496948
    value: 2.4052550792694092
    value: -2.4050939083099365
    value: -2.691270112991333
    value: 0.98831784725189209
    value: 0.768152117729187
    value: -2.3335139751434326
    value: 1.0101559162139893
    value: 0.80450594425201416
    value: -0.90389114618301392
    value: -0.18446809053421021
    value: -0.29454314708709717
  }
}
layers {
  layer_name: "508"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.43936586
    size: 1
    element_type: 0
    scale: 46.880466461181641
    zero_point: 0
  }
  weights {
    min: -0.429395467
    max: 0.419799715
    size: 1
    element_type: 0
    scale: 298.093505859375
    zero_point: 0
  }
  bias {
    min: -1.11169994
    max: 3.45333791
    size: 64
    element_type: 0
    scale: 37.065586090087891
    zero_point: 0
    value: -0.048067942261695862
    value: -0.2183036208152771
    value: 0.41140025854110718
    value: -0.54430735111236572
    value: -0.072409830987453461
    value: 0.22008192539215088
    value: 0.77906489372253418
    value: -1.1116999387741089
    value: -0.044558629393577576
    value: 0.25092554092407227
    value: -0.025489689782261848
    value: 0.52862066030502319
    value: 0.26524794101715088
    value: 0.52064985036849976
    value: -0.6232181191444397
    value: 0.08231961727142334
    value: 0.69668275117874146
    value: -0.43374311923980713
    value: 0.07747950404882431
    value: -0.85661548376083374
    value: -0.34125438332557678
    value: 0.012873182073235512
    value: -0.089052736759185791
    value: 0.68686658143997192
    value: 0.52866280078887939
    value: 0.72637635469436646
    value: -0.012830742634832859
    value: -0.18060384690761566
    value: -0.068399712443351746
    value: -0.31116640567779541
    value: 0.20592163503170013
    value: 0.68005990982055664
    value: 0.42184513807296753
    value: -0.20767439901828766
    value: -0.20663765072822571
    value: -0.05371098592877388
    value: -0.28107577562332153
    value: -0.1388709545135498
    value: 0.5003775954246521
    value: -0.20398369431495667
    value: -1.0289558172225952
    value: 0.4276355504989624
    value: 0.0614924430847168
    value: 0.44099020957946777
    value: -0.36733734607696533
    value: 0.32373920083045959
    value: -0.00606967369094491
    value: 3.4533379077911377
    value: 0.839030921459198
    value: -0.19902007281780243
    value: -0.12074070423841476
    value: 0.49692896008491516
    value: -0.14545382559299469
    value: 0.095595970749855042
    value: 0.022289929911494255
    value: 0.59197616577148438
    value: 0.21048952639102936
    value: 0.31255429983139038
    value: -0.62562930583953857
    value: 0.061946291476488113
    value: -0.084333814680576324
    value: -0.24064496159553528
    value: 0.26681399345397949
    value: 0.093822970986366272
  }
}
layers {
  layer_name: "509"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.85837173
    size: 1
    element_type: 0
    scale: 23.44023323059082
    zero_point: 0
  }
}
layers {
  layer_name: "512"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.26546383
    size: 1
    element_type: 1
    scale: 30.851263046264648
    zero_point: 4294967168
  }
  weights {
    min: -0.900226772
    max: 1.20691848
    size: 1
    element_type: 0
    scale: 106.05521392822266
    zero_point: 0
  }
  bias {
    min: -3.83571219
    max: 6.98787832
    size: 64
    element_type: 0
    scale: 18.317434310913086
    zero_point: 0
    value: -0.076274052262306213
    value: 2.8258206844329834
    value: 0.1628493070602417
    value: 1.3110811710357666
    value: 0.3337382972240448
    value: 0.10865452140569687
    value: -0.74480575323104858
    value: 0.17759509384632111
    value: -3.4070916175842285
    value: -0.56162393093109131
    value: 3.4987912178039551
    value: -0.63975673913955688
    value: 1.2082445621490479
    value: 1.3538311719894409
    value: 1.8484770059585571
    value: -0.26293951272964478
    value: 1.388727068901062
    value: 1.3913432359695435
    value: -1.5359106063842773
    value: 0.49362117052078247
    value: 0.89532315731048584
    value: -2.9522876739501953
    value: -0.076197825372219086
    value: 1.1149312257766724
    value: 0.014568563550710678
    value: 0.20555581152439117
    value: 2.1182196140289307
    value: 2.0790145397186279
    value: 0.89187508821487427
    value: 0.52554446458816528
    value: 2.3578329086303711
    value: 6.9878783226013184
    value: -2.9254982471466064
    value: 2.6092541217803955
    value: -3.835712194442749
    value: -0.60460615158081055
    value: -0.98329061269760132
    value: 3.3403184413909912
    value: -1.001676082611084
    value: 0.47564920783042908
    value: -0.92121344804763794
    value: 0.32438492774963379
    value: 2.5259103775024414
    value: 1.0135515928268433
    value: 1.027532696723938
    value: 1.0606893301010132
    value: 0.21046312153339386
    value: -1.4944772720336914
    value: 2.6969490051269531
    value: 4.1057767868041992
    value: -2.1671054363250732
    value: 1.6870138645172119
    value: -2.1406092643737793
    value: 3.8245556354522705
    value: -2.4820570945739746
    value: -0.19706079363822937
    value: 0.56561404466629028
    value: 1.0109134912490845
    value: 3.8259994983673096
    value: 2.9227428436279297
    value: 4.3902378082275391
    value: 2.4822056293487549
    value: 3.2592897415161133
    value: -0.44658231735229492
  }
}
layers {
  layer_name: "515"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.73106
    size: 1
    element_type: 0
    scale: 32.983833312988281
    zero_point: 0
  }
  weights {
    min: -0.367807627
    max: 0.475275367
    size: 1
    element_type: 0
    scale: 269.31756591796875
    zero_point: 0
  }
  bias {
    min: -1.08109605
    max: 2.04566264
    size: 64
    element_type: 0
    scale: 62.5714111328125
    zero_point: 0
    value: 1.136721134185791
    value: 0.54435163736343384
    value: 0.47557690739631653
    value: -0.0022855896968394518
    value: 0.24646191298961639
    value: 0.76180869340896606
    value: 0.33910858631134033
    value: -1.0810960531234741
    value: 0.49829313158988953
    value: 0.41300103068351746
    value: 1.540783166885376
    value: 0.96304535865783691
    value: 0.05469929426908493
    value: 0.19816833734512329
    value: -0.14498458802700043
    value: 1.2921539545059204
    value: 0.60003471374511719
    value: 0.20469294488430023
    value: 0.1825847327709198
    value: 0.65301311016082764
    value: -0.070386782288551331
    value: 0.87646251916885376
    value: 0.42556387186050415
    value: 0.36507689952850342
    value: 0.21363577246665955
    value: 0.57592642307281494
    value: 0.36476361751556396
    value: 0.527393102645874
    value: 0.22733756899833679
    value: 0.70033472776412964
    value: 0.044281098991632462
    value: 1.2074894905090332
    value: 0.47931379079818726
    value: -0.7518928050994873
    value: 0.050685621798038483
    value: 1.0991089344024658
    value: 0.356784850358963
    value: 0.43298307061195374
    value: 0.33292323350906372
    value: 0.66348552703857422
    value: 0.41687765717506409
    value: 0.58296459913253784
    value: 0.52572852373123169
    value: 0.31598895788192749
    value: 0.27717506885528564
    value: 0.7317548394203186
    value: 0.37951919436454773
    value: 2.0456626415252686
    value: 0.065821222960948944
    value: 0.14884825050830841
    value: -0.45445016026496887
    value: 0.24155682325363159
    value: 0.22307127714157104
    value: -0.74889278411865234
    value: 0.766387403011322
    value: 0.20152521133422852
    value: 0.65696734189987183
    value: 0.66743963956832886
    value: 0.14852502942085266
    value: 0.42958644032478333
    value: 0.11735624074935913
    value: 0.29300057888031006
    value: 0.40436339378356934
    value: 0.12730196118354797
  }
}
layers {
  layer_name: "516"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.94323349
    size: 1
    element_type: 0
    scale: 23.44023323059082
    zero_point: 0
  }
}
layers {
  layer_name: "519"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.16092
    size: 1
    element_type: 1
    scale: 31.246477127075195
    zero_point: 4294967168
  }
  weights {
    min: -0.906602621
    max: 0.975140035
    size: 1
    element_type: 0
    scale: 131.26319885253906
    zero_point: 0
  }
  bias {
    min: -2.66508269
    max: 3.69597507
    size: 64
    element_type: 0
    scale: 34.632266998291016
    zero_point: 0
    value: -0.87750071287155151
    value: 2.1767668724060059
    value: 0.85062533617019653
    value: -0.53301006555557251
    value: 1.952293872833252
    value: -1.5346982479095459
    value: 1.2251578569412231
    value: 1.6487967967987061
    value: 0.58414721488952637
    value: -0.4961601197719574
    value: 0.60753989219665527
    value: 0.13044382631778717
    value: 1.6462695598602295
    value: -0.076376818120479584
    value: 0.62030923366546631
    value: 1.3440585136413574
    value: -0.44828036427497864
    value: 2.2091672420501709
    value: 2.6269617080688477
    value: 1.9577112197875977
    value: -0.94392156600952148
    value: -1.3471249341964722
    value: 2.1931383609771729
    value: -2.2852046489715576
    value: -1.1709389686584473
    value: 1.4442034959793091
    value: 1.232675313949585
    value: -0.30728530883789062
    value: 0.85654067993164062
    value: 1.7694094181060791
    value: 0.18481379747390747
    value: -0.28921934962272644
    value: -0.38871267437934875
    value: 1.1191761493682861
    value: -0.1015213280916214
    value: -1.9292552471160889
    value: 3.1572673320770264
    value: -1.314883828163147
    value: -0.5432199239730835
    value: 0.68510723114013672
    value: 1.8850052356719971
    value: -0.0067321988753974438
    value: -2.495934009552002
    value: 1.6896823644638062
    value: -0.62305557727813721
    value: 0.82930290699005127
    value: 1.9413597583770752
    value: -1.0483776330947876
    value: 1.397337794303894
    value: -1.0442512035369873
    value: 1.6516973972320557
    value: 3.0186319351196289
    value: 1.4040373563766479
    value: -0.79433631896972656
    value: 0.27607262134552
    value: 3.4745790958404541
    value: 3.1418740749359131
    value: -2.6650826930999756
    value: -0.49971720576286316
    value: 3.6959750652313232
    value: -2.2004342079162598
    value: 0.37266793847084045
    value: 0.55804795026779175
    value: 1.7344619035720825
  }
}
layers {
  layer_name: "522"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.9366903
    size: 1
    element_type: 0
    scale: 23.316011428833008
    zero_point: 0
  }
  weights {
    min: -0.823319912
    max: 0.878010392
    size: 1
    element_type: 0
    scale: 145.78414916992188
    zero_point: 0
  }
  bias {
    min: -1.94309568
    max: 7.22787333
    size: 64
    element_type: 0
    scale: 17.709220886230469
    zero_point: 0
    value: -0.23688681423664093
    value: -0.63978481292724609
    value: 0.63684201240539551
    value: 1.61893892288208
    value: -0.35656744241714478
    value: 2.6762614250183105
    value: 0.87540119886398315
    value: 0.645248293876648
    value: 2.6378719806671143
    value: -0.17101284861564636
    value: -0.54739689826965332
    value: 1.5882827043533325
    value: 1.4454413652420044
    value: 0.83822226524353027
    value: 0.24594250321388245
    value: 0.901536762714386
    value: 1.4373165369033813
    value: 0.42681825160980225
    value: 0.28359687328338623
    value: 0.21202868223190308
    value: -0.22420264780521393
    value: -0.83505809307098389
    value: 1.7751153707504272
    value: -0.69731378555297852
    value: 0.50780600309371948
    value: 2.09489107131958
    value: 0.18060685694217682
    value: 3.7278919219970703
    value: 0.67666494846343994
    value: 0.47413191199302673
    value: 0.98798471689224243
    value: 0.24532434344291687
    value: 0.64337784051895142
    value: 0.791633129119873
    value: 0.10982918739318848
    value: -0.013830354437232018
    value: 0.86249357461929321
    value: -0.064213939011096954
    value: 0.64849227666854858
    value: 1.566616415977478
    value: 0.19994793832302094
    value: -0.0069231241941452026
    value: 0.026071676984429359
    value: 0.88629752397537231
    value: 0.0539420060813427
    value: 7.2278733253479
    value: 1.8551032543182373
    value: 1.6395671367645264
    value: 0.13935695588588715
    value: 0.88516557216644287
    value: 0.3079790472984314
    value: 0.26845431327819824
    value: -1.1648873090744019
    value: -1.21119225025177
    value: 0.70366770029067993
    value: 0.6641308069229126
    value: 0.10847517848014832
    value: 0.28860056400299072
    value: -1.9430956840515137
    value: -1.6312696933746338
    value: 0.57439053058624268
    value: 1.8450256586074829
    value: 1.5499805212020874
    value: 0.63547861576080322
  }
}
layers {
  layer_name: "523"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 14.9234219
    size: 1
    element_type: 0
    scale: 11.658005714416504
    zero_point: 0
  }
}
layers {
  layer_name: "524"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 14.9234219
    size: 1
    element_type: 0
    scale: 11.658005714416504
    zero_point: 0
  }
}
layers {
  layer_name: "527"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.3497953
    size: 1
    element_type: 0
    scale: 22.467365264892578
    zero_point: 0
  }
  weights {
    min: -0.7153157
    max: 0.729012251
    size: 1
    element_type: 0
    scale: 175.58003234863281
    zero_point: 0
  }
  bias {
    min: -3.88306165
    max: 3.58371353
    size: 128
    element_type: 0
    scale: 32.963680267333984
    zero_point: 0
    value: 0.33805397152900696
    value: 0.33361700177192688
    value: 1.1549742221832275
    value: 1.1105120182037354
    value: -0.050298072397708893
    value: 0.77591824531555176
    value: 1.3110127449035645
    value: 0.7508094310760498
    value: -3.0498747825622559
    value: 0.68125259876251221
    value: -0.34305480122566223
    value: -0.99727416038513184
    value: 1.0295412540435791
    value: -2.2570121288299561
    value: 1.1181433200836182
    value: 0.63347905874252319
    value: 1.0767519474029541
    value: -0.883784294128418
    value: -1.0059882402420044
    value: 1.0571870803833008
    value: 0.84366977214813232
    value: 0.34262409806251526
    value: 1.7809311151504517
    value: 3.41680908203125
    value: 0.495490163564682
    value: -0.062188740819692612
    value: 0.2400067150592804
    value: 2.2110540866851807
    value: -0.65613770484924316
    value: 0.93235886096954346
    value: -0.3064214289188385
    value: 1.5139443874359131
    value: 1.9647731781005859
    value: 0.47728362679481506
    value: -2.1496407985687256
    value: -0.16178789734840393
    value: 1.8168472051620483
    value: 0.71985316276550293
    value: 0.82375162839889526
    value: 0.077270939946174622
    value: -0.44167625904083252
    value: 0.38317257165908813
    value: -2.5615301132202148
    value: -1.032585620880127
    value: 1.7876683473587036
    value: 0.37143129110336304
    value: 1.1713112592697144
    value: -0.04418528825044632
    value: 1.1253293752670288
    value: 0.0021605403162539005
    value: 0.99414414167404175
    value: -1.7299842834472656
    value: -0.73276293277740479
    value: -0.050805691629648209
    value: 0.641343891620636
    value: -0.015731856226921082
    value: -0.16808189451694489
    value: 1.062848687171936
    value: 0.3197568953037262
    value: 1.0729554891586304
    value: -1.2399314641952515
    value: -0.40383037924766541
    value: 1.8346158266067505
    value: -1.4232479333877563
    value: -1.4885356426239014
    value: 0.053004730492830276
    value: -0.21237990260124207
    value: 1.6955701112747192
    value: 0.816228449344635
    value: 0.10609233379364014
    value: 0.79126894474029541
    value: -0.86034238338470459
    value: 1.4450207948684692
    value: -0.60138732194900513
    value: 0.24207977950572968
    value: -1.3968405723571777
    value: -1.0533343553543091
    value: -0.068991713225841522
    value: 0.12350599467754364
    value: 1.7613787651062012
    value: -2.0638775825500488
    value: -1.0136007070541382
    value: -1.8888448476791382
    value: 0.45030084252357483
    value: -0.52964669466018677
    value: 1.496445894241333
    value: 1.5173310041427612
    value: -0.15051259100437164
    value: -0.32131657004356384
    value: -1.5307204723358154
    value: 1.1575969457626343
    value: -0.10360320657491684
    value: 0.52698361873626709
    value: 2.1902570724487305
    value: -0.15085732936859131
    value: -0.89792829751968384
    value: 0.19800466299057007
    value: -1.3931818008422852
    value: -0.84938424825668335
    value: -0.87717294692993164
    value: 0.26570731401443481
    value: 0.27717646956443787
    value: 1.2191339731216431
    value: 3.5837135314941406
    value: -1.6618034839630127
    value: -1.1371375322341919
    value: 0.041269838809967041
    value: 3.1856720447540283
    value: 0.018912507221102715
    value: 1.5582857131958008
    value: 0.20948244631290436
    value: 0.087396129965782166
    value: 0.6044389009475708
    value: -0.36600896716117859
    value: -0.35637179017066956
    value: 0.15581956505775452
    value: 0.63757050037384033
    value: 0.048162713646888733
    value: 0.72913706302642822
    value: -1.4631320238113403
    value: -1.7221978902816772
    value: 0.49427264928817749
    value: 0.56454634666442871
    value: 0.18427732586860657
    value: -3.8830616474151611
    value: -0.54612821340560913
    value: 0.20934188365936279
    value: 0.39262637495994568
  }
}
layers {
  layer_name: "530"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.81101036
    size: 1
    element_type: 1
    scale: 32.646224975585938
    zero_point: 4294967168
  }
  weights {
    min: -0.589255869
    max: 0.505744338
    size: 1
    element_type: 0
    scale: 217.22312927246094
    zero_point: 0
  }
  bias {
    min: -2.02383
    max: 2.44522238
    size: 256
    element_type: 0
    scale: 52.346977233886719
    zero_point: 0
    value: -0.46053612232208252
    value: 1.227935791015625
    value: -0.051133681088685989
    value: -1.0201358795166016
    value: -0.78484034538269043
    value: -0.51703166961669922
    value: 0.12794776260852814
    value: -1.0746115446090698
    value: 0.93030214309692383
    value: -0.52467674016952515
    value: 0.16413968801498413
    value: -0.0075356950983405113
    value: -0.25383856892585754
    value: -0.34997165203094482
    value: -0.673764169216156
    value: -0.5363534688949585
    value: -0.24187791347503662
    value: -0.0340731106698513
    value: -0.32409822940826416
    value: -0.17350482940673828
    value: 0.21211731433868408
    value: 0.61539214849472046
    value: -0.25182250142097473
    value: -0.080451197922229767
    value: 0.48120447993278503
    value: 0.8395465612411499
    value: -0.013879930600523949
    value: -0.8249778151512146
    value: -0.36633104085922241
    value: -0.70838183164596558
    value: 0.021869869902729988
    value: -0.77628070116043091
    value: -1.1292990446090698
    value: 0.27793958783149719
    value: 0.39746588468551636
    value: -0.16001637279987335
    value: -0.076035164296627045
    value: 0.744249701499939
    value: -1.1464382410049438
    value: -0.94001221656799316
    value: 0.278293639421463
    value: 0.12293899059295654
    value: 0.4880659282207489
    value: -0.44111943244934082
    value: 0.23472709953784943
    value: 0.45866364240646362
    value: -1.4977173805236816
    value: -0.31473389267921448
    value: -0.21567980945110321
    value: 0.56096333265304565
    value: 0.061279982328414917
    value: -0.2666333019733429
    value: 0.71220308542251587
    value: -0.39105582237243652
    value: 0.07232491672039032
    value: -0.92072457075119019
    value: -0.39664933085441589
    value: -0.072615876793861389
    value: -1.9541891813278198
    value: -0.081248365342617035
    value: -0.553053081035614
    value: 0.69725149869918823
    value: -0.37920203804969788
    value: -0.73992246389389038
    value: -0.20636183023452759
    value: 0.024359673261642456
    value: 0.20855481922626495
    value: 0.11979600042104721
    value: -0.62746435403823853
    value: -1.1174275875091553
    value: -0.44290065765380859
    value: -0.53817009925842285
    value: -0.83678549528121948
    value: -0.054573070257902145
    value: 0.55846107006073
    value: 0.10496963560581207
    value: 0.27791401743888855
    value: 0.49893262982368469
    value: 1.3485631942749023
    value: 0.40304377675056458
    value: -0.10844984650611877
    value: 0.13989178836345673
    value: 2.4452223777770996
    value: 0.034087058156728745
    value: -0.37833467125892639
    value: -0.31232139468193054
    value: 0.03671753779053688
    value: -0.11729903519153595
    value: -0.5168302059173584
    value: 0.037994071841239929
    value: -0.51041090488433838
    value: 2.0442094802856445
    value: -1.057231068611145
    value: -0.51097893714904785
    value: -0.51305609941482544
    value: 1.3197735548019409
    value: -0.11536703258752823
    value: 0.55239748954772949
    value: 0.689312219619751
    value: -0.29112476110458374
    value: 0.7864500880241394
    value: -0.19668112695217133
    value: 1.9812449216842651
    value: 1.0654497146606445
    value: 0.91035920381546021
    value: -2.0238299369812012
    value: -0.068421266973018646
    value: -1.3137630224227905
    value: 0.20440664887428284
    value: -0.15164951980113983
    value: -0.26197406649589539
    value: -0.57044500112533569
    value: -0.13249899446964264
    value: 0.66045981645584106
    value: 1.2216560840606689
    value: -0.58571439981460571
    value: 0.60481423139572144
    value: -0.64113461971282959
    value: -0.45940229296684265
    value: -0.21291746199131012
    value: -0.72020614147186279
    value: 0.410646915435791
    value: 0.78428685665130615
    value: 0.30570411682128906
    value: 0.083788305521011353
    value: 0.909088671207428
    value: 0.36132383346557617
    value: 1.9252574443817139
    value: -1.3642988204956055
    value: -0.40145605802536011
    value: -0.54230916500091553
    value: -0.44520378112792969
    value: -0.99168652296066284
    value: -0.69776564836502075
    value: -0.11733634769916534
    value: -0.33274194598197937
    value: -0.26421737670898438
    value: -0.42142292857170105
    value: 0.25385111570358276
    value: -0.3527410626411438
    value: 0.16486881673336029
    value: -0.066155612468719482
    value: -0.168134406208992
    value: -0.480996698141098
    value: 0.039440274238586426
    value: 0.941025972366333
    value: 0.030288334935903549
    value: -0.20685718953609467
    value: -0.089941300451755524
    value: -0.0028846596833318472
    value: -0.67883527278900146
    value: -0.40999454259872437
    value: -0.70341145992279053
    value: -0.24627989530563354
    value: -1.1754573583602905
    value: 1.4521560668945312
    value: -0.73618209362030029
    value: -0.058668904006481171
    value: 0.42158576846122742
    value: 0.74769693613052368
    value: 0.04459400475025177
    value: -0.37410086393356323
    value: 0.68235319852828979
    value: -0.4421752393245697
    value: -1.3341811895370483
    value: 0.65821248292922974
    value: 0.08295372873544693
    value: -0.56594324111938477
    value: 0.23874443769454956
    value: 0.12713088095188141
    value: 0.76716709136962891
    value: 0.24667420983314514
    value: -0.352130651473999
    value: 0.24331836402416229
    value: 0.26610848307609558
    value: -0.34329500794410706
    value: 0.41331750154495239
    value: 1.1543700695037842
    value: -0.710070013999939
    value: -0.73228079080581665
    value: 0.61973035335540771
    value: 0.0982653871178627
    value: -0.18367196619510651
    value: -0.69464623928070068
    value: -0.89014685153961182
    value: 0.83728104829788208
    value: -0.62675726413726807
    value: -0.12142867594957352
    value: -0.57995748519897461
    value: 0.5886986255645752
    value: -0.11744984984397888
    value: -0.14510154724121094
    value: -0.960910439491272
    value: -1.3678805828094482
    value: 0.030271666124463081
    value: -0.71183943748474121
    value: -0.027763457968831062
